app/controllers/admin/filters_controller.rb

 def create
    @admin_filter = Admin::Filter.new(params[:admin_filter])

    respond_to do |format|
      if @admin_filter.save
---
INSERT INTO "admin_filters" ("action_type", "condition", "created_at", "name", "operator", "slug", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

 def destroy
    @admin_filter = Admin::Filter.find(params[:id])
    @admin_filter.destroy
---
DELETE FROM "admin_filters" WHERE "admin_filters"."id" = $1  [["id", 2]]