app/controllers/sales_controller.rb

  def create

    @sale = Sale.new(params[:sale])

    respond_to do |format|
      if @sale.save
---
INSERT INTO "sales" ("address", "city", "country", "created_at", "email", "gateway", "name", "order_date", "order_status", "product_id", "state", "total_amount", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

   def index
    @sales = Sale.all
---
SELECT "sales".* FROM "sales"

  def show
    @sale = Sale.find(params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @sale= Sale.find(params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT 1  [["id", "1"]]